app/views/parking_spaces/_show.json.jbuilder

INSERT INTO "parking_spaces" ("location_lat", "location_long", "recorded_from_lat", "recorded_from_long", "target_price", "target_price_currency", "interval", "image_file_name", "image_content_type", "title", "address_line_1", "address_line_2", "space_availability_start", "space_availability_stop", "deviceid", "owner_name", "standard_image_url", "thumbnail_image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---

json.timestamp parking_space.created_at