app/controllers/parameters_controller.rb

SELECT "parameter_values".* FROM "parameter_values" WHERE "parameter_values"."parameter_id" IN (1, 3, 4, 5, 6, 7)
SELECT "parameters".* FROM "parameters"
---
  def index
    @parameters =  Parameter.all.includes(:parameter_values)

SELECT  "parameters".* FROM "parameters" WHERE "parameters"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_parameter
      @parameter = Parameter.find(params[:id])