app/controllers/parking_spaces_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."proposal_id" IN (1)
SELECT "parking_spaces".* FROM "parking_spaces" WHERE (parking_spaces.space_availability_stop >= '2016-12-01 09:52:24.553621' ) AND (parking_spaces.space_availability_start <= '2016-12-01 09:52:24.554158' ) AND (parking_spaces.location_lat >= 44.40711364584098
---

    query_attrs = {lon_min: lon_min, lon_max: lon_max, lat_min: lat_min, lat_max: lat_max}
    # add long term
    @parking_spaces = ParkingSpace.not_expired.active.within_boundaries(query_attrs).includes(proposals: [:messages])

SELECT "messages".* FROM "messages" WHERE "messages"."proposal_id" IN (2, 3)
SELECT "parking_spaces".* FROM "parking_spaces" WHERE "parking_spaces"."deviceid" = ?
SELECT  "users".* FROM "users" WHERE "users"."device_id" = ? LIMIT 1
---
  def myspaces
    deviceid = current_user.device_id

    unless deviceid
      render json: {Error: {general: "Missing deviceid"}}, status: :unprocessable_entity
      return
    end

    @parking_spaces = ParkingSpace.includes(proposals: [:messages]).where({deviceid: deviceid})

    @parking_spaces.each do |space|
      space.owner = User.find_by_device_id deviceid

SELECT  "users".* FROM "users" WHERE "users"."device_id" = ? LIMIT 1
---
  def myoffers
    deviceid = current_user.device_id

    unless deviceid
      render json: {Error: {general: "Missing deviceid"}}, status: :unprocessable_entity
      return
    end

    @parking_spaces = ParkingSpace.includes(proposals: [:messages]).where(proposals: {deviceid: deviceid})

    @parking_spaces.each do |space|
      space.owner = User.find_by_device_id space.deviceid

SELECT  "parking_spaces".* FROM "parking_spaces" WHERE "parking_spaces"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "proposals" SET "read" = 't' WHERE "proposals"."parking_space_id" = ?  [["parking_space_id", 2]]
SELECT "messages".* FROM "messages" WHERE "messages"."proposal_id" IN (2)
SELECT "proposals".* FROM "proposals" WHERE "proposals"."parking_space_id" IN (2)
---
  def mark_offers_as_read
    parking_space_id = params[:parking_space_id]
    @parking_space = ParkingSpace.find(parking_space_id)

    if @parking_space.proposals
      @parking_space.proposals.update_all(read: true)
    end

    @parking_space = ParkingSpace.includes(proposals: [:messages]).find(parking_space_id)

INSERT INTO "parking_spaces" ("location_lat", "location_long", "recorded_from_lat", "recorded_from_long", "target_price", "target_price_currency", "interval", "image_file_name", "image_content_type", "title", "address_line_1", "address_line_2", "space_availability_start", "space_availability_stop", "deviceid", "owner_name", "standard_image_url", "thumbnail_image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @parking_space = ParkingSpace.new(parking_space_params)
    @parking_space.deviceid = current_user.device_id
    @parking_space.owner_name = current_user.full_name

    respond_to do |format|
      if @parking_space.save

UPDATE "parking_spaces" SET "target_price" = ?, "created_at" = ?, "updated_at" = ? WHERE "parking_spaces"."id" = ?  [["target_price", 6.0], ["created_at", "2016-12-01 11:49:08.278000"], ["updated_at", "2016-12-01 15:38:38.303579"], ["id", 2]]
---
  def update

    if current_user.device_id != @parking_space.deviceid
      render json: {Error: {general: "Device id invalid"}}, status: :unprocessable_entity
      return
    end

    respond_to do |format|
      if @parking_space.update(parking_space_params)

SELECT  "parking_spaces".* FROM "parking_spaces" WHERE "parking_spaces"."id" = ? LIMIT 1  [["id", 2]]
---
  def set_parking_space
    @parking_space = ParkingSpace.find(params[:id])