app/controllers/parking_spaces_controller.rb

  def index

    if current_user.company
      @parking_spaces = ParkingSpace.not_expired.active
                            .includes(:parking_perimeter)
                            .includes(:proposals)
                            .for_company current_user.company
---
SELECT "proposals".* FROM "proposals" WHERE "proposals"."parking_space_id" IN (1)

  def myspaces
    @parking_spaces = ParkingSpace.includes(:proposals, :user)
                          .where(user: current_user)
---
SELECT "proposals".* FROM "proposals" WHERE "proposals"."parking_space_id" IN (3)