app/controllers/proposals_controller.rb

  def create
    @proposal = Proposal.new(proposal_params)
    @proposal.bidder_name = current_user.full_name
    @proposal.phone_number = current_user.phone_number
    @proposal.user = current_user

    if @proposal.save
---
INSERT INTO "proposals" ("bid_amount", "bid_currency", "parking_space_id", "approval_status", "deviceid", "bidder_name", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def set_proposal
    @proposal = Proposal.find(params[:id])
---
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT 1  [["id", 2]]